<template>
    <div class="newsDetailCon w12">
        <div class="inNewDetailCon">
            <div class="title tac">
            <h2 class="tac f20">用户协议</h2>
        </div>
        <div class="content f12">
            <h4 class="f16">1. 特别提示</h4>
            <p>
               1.1浙江网云软件有限公司（以下合称"网云软件"）同意按照本协议的规定及其不时发布的操作规则提供基于互联网以及移动网的相关服务（以下称"网络服务"），巅峰电竞比赛服务平台是由杭州网云软件科技有限公司为用户提供的互联网产品。为获得网云软件提供的服务，服务使用人（以下称"用户"）应当同意本协议的全部条款并按照页面上的提示完成全部的注册程序。用户点击“验证登录”或“同意”按钮并按注册登录程序成功注册后，您的行为就已表示您无条件接受并遵守本使用条款以及网云软件及巅峰电竞不时公布的各项“其他公开规则”。
            </p>
            <p>
               1.2 用户注册/登录成功后，网云软件将给予每个用户一个用户帐号及相应的密码，该用户帐号和密码由用户负责保管；用户应当对以其用户帐号进行的所有活动和事件负法律责任。
            </p>
            <p>
               1.2 用户注册/1.3 以下协议内容中，杭州网云软件科技有限公司（以下合称"网云软件"）为甲方，用户为乙方。
            </p>
            <h4 class="f16">2. 服务内容</h4>
            <p>
               网云软件网络服务的具体内容由网云软件根据实际情况提供，包括但不仅限于巅峰电竞比赛服务平台、升级程序、论坛(BBS)、聊天室、电子邮件、发表新闻评论等。
            </p>
            <h4 class="f16">3. 服务变更、中断或终止</h4>
            <p>
               3.1 鉴于网络服务的特殊性，用户同意网云软件有权随时变更、中断或终止部分或全部的网络服务（包括收费网络服务）。如变更、中断或终止的网络服务属于免费网络服务，网云软件无需通知用户，也无需对任何用户或任何第三方承担任何责任；如变更、中断或终止的网络服务属于收费网络服务，网云软件应当在变更、中断或终止之前事先通知用户，并应向受影响的用户提供等值的替代性的收费网络服务，如用户不愿意接受替代性的收费网络服务，就该用户已经向网云软件支付的服务费，网云软件应当按照该用户实际使用相应收费网络服务的情况扣除相应服务费之后将剩余的服务费退还给该用户。
            </p>
            <p>
                3.2 用户理解，网云软件需要定期或不定期地对提供网络服务的平台（如互联网网站、移动网络等）或相关的设备进行检修或者维护，如因此类情况而造成收费网络服务在合理时间内的中断，网云软件无需为此承担任何责任，但网云软件将尽可能事先进行通告。
            </p>
            <p>
                3.3网云软件网络服务（尤指但不仅指巅峰电竞比赛服务平台及附带相关软件）的各个新版本，网云软件可以自行决定保留为网云软件网络服务增加附加特点和功能，或者提供程序编程之修补、更新和升级的权利。网云软件无需向您发出通知即可自行决定修改、停止或暂停您对任何版本网云软件网络服务的使用，和/或禁用您已经使用或安装的网云软件网络服务，以便对相关技术进行检修、改良和/或升级，或者出于其他合理原因；对于由发行和/或不发行网云软件网络服务的新版本而导致的直接或间接损害，网云软件将不承担任何赔偿责任。
            </p>
            <p>
                3.4 用户有如下任何一种或多种行为的，网云软件有权随时取消该用户账号或终止或暂停对该用户的全部或部分服务（包括但不限于封停该用户帐号），并且有权随时取消或收回用户在游戏内获取的任何利益，而无需对用户或任何第三方承担任何责任：
            </p>
            <p>
                3.4.1 用户提供的个人资料不真实；
            </p>
            <p>
                3.4.2 用户违反本协议中规定的使用规则或者在使用网云软件服务及其连带服务中作弊、以及发生封号规则中的相关行为；
            </p>
            <p>
                3.4.3 用户在使用收费网络服务时未按规定向网云软件支付相应的服务费；
            </p>
            <p>
                3.4.4 用户注册的帐号自注册起30天内或连续180天，没有使用过该帐号（包括使用该帐号登录游戏、登录网站、充值），则网云软件有权删除该帐号，包括但不限于注册信息、等级信息、物品信息等一切与该注册帐号相关的信息；
            </p>
            <p>
                3.5 用户有发布违法信息、严重违背社会公德、以及其他违反法律禁止性规定的行为，网云软件应当立即终止对用户提供服务。
            </p>
            <p>
                3.6 用户在接受网云软件服务时实施不正当行为的，网云软件有权终止对乙方提供服务。该不正当行为的具体情形应当在本协议中有明确约定或属于网云软件事先明确告知的应被终止服务的禁止性行为，否则，甲方不得终止对用户提供服务。
            </p>
            <p>
                3.7 用户提供虚假注册身份信息，或实施违反本协议的行为，网云软件有权中止对用户提供全部或部分服务；网云软件采取中止措施应当通知用户并告知中止期间，中止期间应该是合理的，中止期间届满网云软件应当及时恢复对乙方的服务。
            </p>
            <p>
                3.8 网云软件根据本条约定中止或终止对用户提供部分或全部服务的，网云软件应负举证责任。
            </p>
            <p>
                3.9 用户应确实遵守本协议条款及有关法律命令的规定。网云软件对于用户是否违反本协议条款有最终解释权。若网云软件认定用户违反协议条款或任何法令者，用户同意网云软件可以随时终止其帐号的使用。
            </p>
            <h4>4. 使用规则</h4>
            <p>
                4.1用户承诺以其真实身份注册成为网云软件的用户，并保证所提供的个人身份资料信息真实、完整、有效，依据法律规定和必备条款约定对所提供的信息承担相应的法律责任。用户以其真实身份注册成为网云软件用户后，需要修改所提供的个人身份资料信息的，网云软件应当及时、有效地为其提供该项服务。
            </p>
            <p>
                4.2网云软件有权审查用户注册所提供的身份信息是否真实、有效，并应积极地采取技术与管理等合理措施保障用户账号的安全、有效；用户有义务妥善保管其账号及密码，并正确、安全地使用其账号及密码。任何一方未尽上述义务导致账号密码遗失、账号被盗等情形而给用户和他人的民事权利造成损害的，应当承担由此产生的法律责任。
            </p>
            <p>
                4.3 用户对登录后所持账号产生的行为依法享有权利和承担责任。
            </p>
            <p>
                4.4 用户发现其账号或密码被他人非法使用或有使用异常的情况的，应及时根据网云软件公布的处理方式通知网云软件，并有权通知甲方采取措施暂停该账号的登录和使用。网云软件根据用户的通知采取措施暂停用户账号的登录和使用的，网云软件应当要求用户提供并核实与其注册身份信息相一致的个人有效身份信息。网云软件核实用户所提供的个人有效身份信息与所注册的身份信息相一致的，应当及时采取措施暂停用户该账号的登录和使用。网云软件违反前述约定，未及时采取措施暂停用户账号的登录和使用，因此而给用户造成损失的，应当承担其相应的法律责任。用户没有提供其个人有效身份证件或者用户提供的个人有效身份证件与所注册的身份信息不一致的，网云软件有权拒绝用户上述请求。
            </p>
            <p>
                4.5 用户为了维护其合法权益，向网云软件提供与所注册的身份信息相一致的个人有效身份信息时，网云软件应当为用户提供账号注册人证明、原始注册信息等必要的协助和支持，并根据需要向有关行政机关和司法机关提供相关证据信息资料。
            </p>
            <p>
                4.6 用户不应将其帐号、密码转让或出借予他人使用。如用户发现其帐号遭他人非法使用，应立即通知网云软件。因黑客行为或用户的保管疏忽导致帐号、密码遭他人非法使用，网云软件不承担任何责任。
            </p>
            <p>
                4.7 用户同意接受网云软件通过电子邮件或其他方式向用户发送商品促销或其他相关商业信息。
            </p>
            <p>
                4.8 用户对于其创作并通过网云软件网络服务（包括但不限于博客、论坛、新闻评论、个人家园）上传到网云软件网站上的内容依法享有版权及其他相关合法权利。对于用户通过网云软件网络服务上传到网云软件网站上可公开获取区域的任何内容，用户同意网云软件在全世界范围内具有免费的、永久性的、不可撤销的权利和许可，以使用、复制、修改、翻译、据以创作衍生作品、传播、表演和展示此等内容（整体或部分）。
            </p>
            <p>
               4.9 用户在使用网云软件网络服务过程中，必须遵循以下原则： 
            </p>
            <p>
                1） 遵守中国有关的法律和法规；
            </p>
            <p>
                2） 遵守所有与网络服务有关的网络协议、规定和程序；
            </p>
            <p>
                3） 不得为任何非法目的而使用网络服务系统；
            </p>
            <p>
                4） 不得利用网云软件网络服务系统进行任何可能对互联网或移动网正常运转造成不利影响的行为；
            </p>
            <p>
               5） 不得利用网云软件提供的网络服务上传、展示或传播任何虚假的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料； 
            </p>
            <p>
                6） 不得侵犯其他任何第三方的专利权、著作权、商标权、名誉权或其他任何合法权益；
            </p>
            <p>
                7） 不得利用网云软件网络服务系统进行任何不利于网云软件的行为；
            </p>
            <p>
                8） 如发现任何非法使用用户帐号或帐号出现安全漏洞的情况，应立即通告网云软件；
            </p>
            <p>
                9） 不使用外挂或者其他作弊手段参加网云软件网络服务及其服务所延伸的产品与服务。如果网云软件发现用户数据异常，有权根据本协议的规定，采取相应措施：包括但不限于对该帐号的冻结、终止、删除；基于上述行为而遭网云软件冻结、终止、删除帐号或采取其他限制措施的用户，不得因此要求网云软件做任何补偿或退费。
            </p>
            <p>
                4.10 如用户在使用网络服务时违反任何上述规定，网云软件或其授权的人有权要求用户改正或直接采取一切必要的措施（包括但不限于更改或删除用户张贴的内容等、暂停或终止用户使用网络服务的权利）以减轻用户不当行为造成的影响。
            </p>
            <p>
                4.11 网云软件针对某些特定的网云软件网络服务的使用通过各种方式（包括但不限于网页公告、电子邮件、短信提醒等）作出的任何声明、通知、警示等内容视为本协议的一部分，用户如使用该等网云软件网络服务，视为用户同意该等声明、通知、警示的内容。
            </p>
            <p>
                4.12 目前版本中，用户输入的手机号码，作为网云软件用户的唯一有效身份证明；在无法有效证明其身份时，网云软件有权拒绝提供任何信息或承担任何义务。
            </p>
            <p>
                4.13您通过服务对程序的使用受制于某些已经包含在规则中的行为准则。这些规则将在网云软件游戏官方网站公开并不定期更新，所有通过服务使用程序的用户必须遵守。您有义务知晓、了解并遵守这些行为规则。网云软件游戏保留权利决定何种行为违反游戏精神，并对该等行为采取其认为合适的相应的处理措施（包括但不限于警告、回收虚拟物品、倒扣数值、暂时或永久冻结账号、拒绝提供服务，等）。网云软件游戏保留随时修改这些行为规则的权利。
            </p>
            <h4>5. 知识产权</h4>
            <p>
                5.1 网云软件提供的网络服务中包含的任何文本、图片、图形、音频和/或视频资料均受版权、商标和/或其它财产所有权法律的保护，未经相关权利人同意，上述资料均不得在任何媒体直接或间接发布、播放、出于播放或发布目的而改写或再发行，或者被用于其他任何商业目的。所有这些资料或资料的任何部分仅可作为私人和非商业用途而保存在某台计算机内。网云软件不就由上述资料产生或在传送或递交全部或部分上述资料过程中产生的延误、不准确、错误和遗漏或从中产生或由此产生的任何损害赔偿，以任何形式，向用户或任何第三方负责。
            </p>
            <p>
                5.2 网云软件为提供网络服务而使用的任何软件（包括但不限于软件中所含的任何图象、照片、动画、录像、录音、音乐、文字和附加程序、随附的帮助材料）的一切权利均属于该软件的著作权人，未经该软件的著作权人许可，用户不得对该软件进行反向工程（reverse engineer）、反向编译（decompile）或反汇编（disassemble）。
            </p>
            <h4>6. 隐私保护</h4>
            <p>
                6.1 保护用户隐私是网云软件的一项基本政策，未经用户许可网云软件不得向任何第三方提供、公开或共享用户资料中可能包含的姓名、个人有效身份证件号码、联系方式、家庭住址等个人身份信息，但下列情况除外：
            </p>
            <p>
                6.1.1 用户或用户监护人授权甲方披露的；
            </p>
            <p>
                6.1.2 有关法律要求网云软件披露的；
            </p>
            <p>
                6.1.3 司法机关或行政机关基于法定程序要求网云软件提供的；
            </p>
            <p>
                6.1.4 用户为了维护自己合法权益而向网云软件提起诉讼或者仲裁时；
            </p>
            <p>
                6.1.5 应用户监护人的合法要求而提供用户个人身份信息时；
            </p>
            <p>
               6.1.6 为维护社会公众的利益。 
            </p>
            <p>
                6.2在不透露单个用户隐私资料的前提下，网云软件有权对整个用户数据库进行技术分析并对已进行分析、整理后的用户数据库进行商业上的利用。尽管网云软件对用户的隐私权保护做了极大的努力，但是仍然不能保证现有的安全技术措施使用户的技术信息等不受任何形式的损失。
            </p>
            <p>
                6.3 为了向您提供服务，我们可能会收集有关服务性能、您的计算机和您的服务使用情况的特定信息。我们可能会自动从您的计算机中上载此信息。该数据不会标识您的个人身份。
            </p>
            <h4>7. 免责声明</h4>
            <p>
                7.1 用户明确同意其使用网云软件网络服务所存在的风险将完全由其自己承担；因其使用网云软件网络服务而产生的一切后果也由其自己承担，网云软件对用户不承担任何责任。
            </p>
            <p>
               7.2 网云软件不担保网络服务一定能满足用户的要求，也不担保网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作担保。 
            </p>
            <p>
               7.3 网云软件不保证为向用户提供便利而设置的外部链接的准确性和完整性，同时，对于该等外部链接指向的不由网云软件实际控制的任何网页上的内容，网云软件不承担任何责任。 
            </p>
            <p>
               7.4 对于因不可抗力或网云软件不能控制的原因造成的网络服务中断或其它缺陷，网云软件不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。 
            </p>
            <p>
                7.5 用户同意，对于网云软件向用户提供的下列产品或者服务的质量缺陷本身及其引发的任何损失，网云软件无需承担任何责任：
            </p>
            <p>
                7.5.1 网云软件向用户免费提供的各项网络服务；
            </p>
            <p>
                7.5.2 网云软件向用户赠送的任何产品或者服务；
            </p>
            <p>
              7.5.3 网云软件向收费网络服务用户附赠的各种产品或者服务。  
            </p>
            <p>
               7.6 针对网云软件网络服务中免费供用户使用的部分。您承认并同意网云软件、其关联方、其许可人及网云软件员工无须承担由于您使用网云软件网络服务中免费供用户使用的部分而产生或引发的任何责任。对于网云软件网络服务中免费供用户使用的部分存在的任何问题或任何不满，您唯一的权利及补救措施就是立即卸载并停止使用巅峰电竞比赛服务平台及附带相关软件。  
            </p>
            <p>
                7.7 关于网云软件的收费网络服务：
            </p>
            <p>
                7.7.1 网云软件有权根据需要，可以随时在其产品中设立及添加收费网络服务、发行收费服务点卡以及接入其他商家发行的收费服务点卡等收费网络服务；
            </p>
            <p>
                7.7.2 网云软件有权对各游戏中的收费网络服务进行定价，并根据需要随时调整；
            </p>
            <p>
                7.7.3 网云软件有权根据需要，修改收费网络服务；
            </p>
            <p>
                7.7.4 用户一经将增值服务点卡在网云软件网络服务系统充值，即视为该点卡已消费完毕；
            </p>
            <p>
               7.7.5 对于网云软件网络服务系统的收费网络服务，网云软件拥有最终解释权。 
            </p>
            <p>
              7.8 在任何情况下，即使网云软件、其关联方或网云软件员工事先知道下述损失的可能性，网云软件、其关联方或网云软件员工都无须在合同、保证、侵权（包括过失）、产品责任或其他任何形式的责任方面，为由于使用或无法使用网云软件网络服务而产生的任何间接的、偶然的、特殊的或必然的损失（包括但不限于任何数据的损坏、服务的中断、计算机无法操作或金钱上的损失）负责。   
            </p>
            <p>
                7.9 在适用法律允许的最大范围内，网云软件明确表示不提供任何其他类型的保证，不论是明示的或默示的，包括但不限于适销性、适用性、可靠性、准确性、完整性、无病毒以及无错误的任何默示保证和责任。
            </p>
            <p>
                8. 违约赔偿
            </p>
            <p>
                8.1 如因网云软件违反有关法律、法规或本协议项下的任何条款而给用户造成损失，网云软件同意承担由此造成的损害赔偿责任。
            </p>
            <p>
                8.2 用户同意保障和维护网云软件及其他用户的利益，如因用户违反有关法律、法规或本协议项下的任何条款而给网云软件或任何其他第三人造成损失，用户同意承担由此造成的损害赔偿责任。
            </p>
            <h4>
                9. 协议修改
            </h4>
            <p>
                9.1 网云软件有权随时修改本协议的任何条款，一旦本协议的内容发生变动，网云软件游戏将会在相关的页面上提示修改内容。修改后的服务协议一旦在页面上公布即有效代替原来的服务协议。用户可随时造访www.17dfgame.com查阅最新用户协议。
            </p>
            <p>
                9.2 如果不同意网云软件对本协议相关条款所做的修改，用户有权停止使用网络服务。如果用户继续使用网络服务，则视为用户接受网云软件对本协议相关条款所做的修改。 
            </p>
            <h4>10. 通知送达</h4>
            <p>
                10.1 本协议项下网云软件对于用户所有的通知均可通过网页公告、电子邮件、手机短信或常规的信件传送等方式进行；该等通知于发送之日视为已送达收件人。
            </p>
            <p>
                10.2 用户对于网云软件的通知应当通过网云软件对外正式公布的通信地址、传真号码、电子邮件地址等联系信息进行送达。
            </p>
            <h4>11. 法律管辖</h4>
            <p>
                11.1 本协议的订立、执行和解释及争议的解决均应适用中国法律并受中国法院管辖。
            </p>
            <p>
                11.2 如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，任何一方均可向网云软件公司所在地的人民法院提起诉讼。 
            </p>
            <h4>12. 其他规定</h4>
            <p>
                12.1 本协议构成双方对本协议之约定事项及其他有关事宜的完整协议，除本协议规定的之外，未赋予本协议各方其他权利。 
            </p>
            <p>
                12.2 如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。
            </p>
            <p>
                12.3 本协议中的标题仅为方便而设，在解释本协议时应被忽略。
            </p>
            
        </div>
        </div>
        
    </div>
</template>
<style lang="scss" scoped>
.newsDetailCon {
  padding-top: 46px;
  .inNewDetailCon {
    padding: 46px 80px;
    background: rgba(36, 42, 53, 1);
    border: 1px solid rgba(53, 61, 77, 1);
    box-sizing: border-box;
  }
  .title {
    color: rgba(128, 128, 138, 1);
    padding-bottom: 20px;
    border-bottom: 1px solid rgba(255, 255, 255, .4);
    margin-bottom: 20px;
    h2 {
      color: rgba(255, 255, 255, 1);
      margin-bottom: 10px;
    }
  }
  .content {
    text-indent: 2em;
    color: rgba(202, 200, 200, 1);
    line-height: 26px;
    h4{
        font-size: 16px;
    }
    p {
      margin-bottom: 20px;
    }
  }
}
</style>

